// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
double a;

a = 100.2;

if ((a % 2) == 0)
{
    Console.Write("Введено четное число");
}
else
{
    Console.Write("Введено нечетное число");
}